tests/fixtures/omise-charge-get.json

{
  "object": "charge",
  "id": "chrg_test_63vhnmwmt69576xfjn5",
  "location": "/charges/chrg_test_63vhnmwmt69576xfjn5",
  "amount": 5000,
  "acquirer_reference_number": null,
  "net": 4804,
  "fee": 183,
  "fee_vat": 13,
  "interest": 0,
  "interest_vat": 0,
  "funding_amount": 5000,
  "refunded_amount": 0,
  "transaction_fees": {
    "fee_flat": "0.0",
    "fee_rate": "3.65",
    "vat_rate": "7.0"
  },
  "platform_fee": {
    "fixed": null,
    "amount": null,
    "percentage": null
  },
  "currency": "THB",
  "funding_currency": "THB",
  "ip": null,
  "refunds": {
    "object": "list",
    "data": [],
    "limit": 20,
    "offset": 0,
    "total": 0,
    "location": "/charges/chrg_test_63vhnmwmt69576xfjn5/refunds",
    "order": "chronological",
    "from": "1970-01-01T00:00:00Z",
    "to": "2025-05-30T03:23:27Z"
  },
  "link": null,
  "description": null,
  "metadata": {},
  "missing_3ds_fields": [
    "email",
    "phone_number"
  ],
  "card": {
    "object": "card",
    "id": "card_test_63vhnkw4it3t7q3s9ei",
    "livemode": false,
    "location": null,
    "deleted": false,
    "street1": null,
    "street2": null,
    "city": null,
    "state": null,
    "phone_number": null,
    "postal_code": null,
    "country": "",
    "financing": "",
    "bank": "",
    "brand": "Visa",
    "fingerprint": "6Dg5ncsSseId+2Pkar1y8MNjk+1MPEYQaBAWxr64McE=",
    "first_digits": null,
    "last_digits": "4242",
    "name": "Ros",
    "expiration_month": 9,
    "expiration_year": 2028,
    "security_code_check": true,
    "tokenization_method": null,
    "created_at": "2025-05-29T09:10:29Z"
  },
  "source": null,
  "schedule": null,
  "linked_account": null,
  "customer": null,
  "dispute": null,
  "transaction": null,
  "failure_code": null,
  "failure_message": null,
  "merchant_advice": null,
  "merchant_advice_code": null,
  "status": "pending",
  "authorize_uri": "https://api.staging-omise.co/payments/paym_test_63vhnmwphvo55z145sv/authorize",
  "return_uri": "https://www.omise.co",
  "created_at": "2025-05-29T09:10:39Z",
  "paid_at": null,
  "authorized_at": null,
  "expires_at": "2025-06-05T09:10:39Z",
  "expired_at": null,
  "reversed_at": null,
  "multi_capture": false,
  "zero_interest_installments": false,
  "branch": null,
  "terminal": null,
  "device": null,
  "authorized": false,
  "capturable": false,
  "capture": true,
  "disputable": false,
  "livemode": false,
  "refundable": false,
  "partially_refundable": false,
  "reversed": false,
  "reversible": false,
  "voided": false,
  "paid": false,
  "expired": false,
  "can_perform_void": false,
  "approval_code": null
}
